---
kind: type
id: T:Autodesk.Revit.DB.HermiteSpline
source: html/6852ca4c-2fad-cda1-be75-54e712a39318.htm
---
# Autodesk.Revit.DB.HermiteSpline

A Hermite spline.

## Syntax (C#)
```csharp
public class HermiteSpline : Curve
```

## Remarks
The Hermite spline lies in the plane defined by control points.